{
  "rules": [
    "Avoid vague adjectives like \"dynamic,\" \"intelligent,\" and \"adaptive\" without concrete examples.",
    "Use bolding sparingly and strategically to emphasize critical points.",
    "Minimize the use of italics.",
    "Try replacing \"while\" with \"as\" or splitting the sentence in two.",
    "Never open with \"We stand on the precipice...\" or \"Imagine a future where...\". It's the digital equivalent of a generic stock photo.",
    "Avoid hyperbolic adjectives like \"profound,\" \"perfect,\" \"unheard-of,\" and \"grand\" unless you can back them up with specific, undeniable evidence. Your post is a thesaurus entry for \"aspirational but vague.\"",
    "Stop using fluffy, unspecific metaphors like \"orchestra of AI agents\" or \"digital nervous system\" without immediately following up with concrete, digestible examples. They sound impressive for a second, then fall flat.",
    "If your post sounds like it was written by the same AI it's trying to promote, you've failed. This sounds exactly like ChatGPT's default \"positive, futuristic, slightly buzzwordy\" tone.",
    "Stop using vague, aspirational language that promises everything but delivers nothing specific. \"Reimagining creation itself\" is peak LinkedIn over-promising.",
    "Break up long paragraphs. Use bullet points, short sentences, and bold text to highlight key information.",
    "Never use the word 'unleash'. (And yes, the image text \"Unleash Your Vision\" falls right into this trap. And \"Architect Tomorrow\" is just as bland as the rest of it.)",
    "Never use \"new dawn,\" \"era setting,\" or similar overly dramatic and cliché metaphors for technological progress. Be original or be quiet.",
    "Eliminate at least 50% of your adjectives. If it's not adding critical, unique meaning, it's just fluff.",
    "Avoid buzzword bingo like \"collaborative intelligence,\" \"agentic AI\" (without explaining it beyond surface level), \"seamless integration,\" and \"co-create\" if you want to sound like a human and not a marketing bot.",
    "Your call to action (\"Let's discuss, imagine, and build these futures, together. Share your vision below!\") is weak, generic, and overused. Make it specific, actionable, and less like a motivational poster from 2005.",
    "If your post starts with \"X is a term often misunderstood,\" delete it. It's the lazy, unoriginal opener of a thousand forgettable AI-generated explainers. Hook me with a problem, a provocative statement, or a bold prediction – not a promise to clarify.",
    "Avoid ending your post with a generic, open-ended \"What should I demystify next?\" It's the hallmark of someone who has run out of original thoughts and is desperately fishing for engagement bait. Offer a strong call to action, a bold prediction, or just shut up.",
    "If your post sounds like it was generated by the very AI you're trying to explain, you've failed. Your voice, however flawed, is preferable to polished blandness.",
    "Eliminate redundant summary sentences. The line \"Agentic AI moves beyond assistance to partnership, managing complex workflows. This is key for development.\" adds nothing substantial that hasn't already been covered. Your readers aren't goldfish.",
    "Never start a LinkedIn post with a generic \"We're all...\" or \"It's clear that...\" opener. It's the verbal equivalent of a corporate handshake – cold and uninspired.",
    "Avoid adjective stuffing. Let powerful nouns and verbs do the heavy lifting, reserving adjectives for truly impactful descriptions.",
    "LinkedIn is not an academic paper. Break up dense paragraphs into digestible chunks, use bullet points, and leverage whitespace.",
    "Eliminate passive voice and corporate jargon that makes your writing sound like an AI trying to sound human. Get direct. Get punchy.",
    "Never open with a vague, generic statement like \"The way we engage with [X] is fundamentally shifting.\" It's cliché and instantly signals a lack of original thought.",
    "Avoid excessive, vague positive adjectives. They dilute your message and make your writing sound like a marketing brochure, not a human.",
    "Break up long paragraphs with strategic formatting (bolding, italics, bullet points, short sentences) to improve scannability. LinkedIn is not for dense prose.",
    "Stop using corporate buzzwords like \"new horizon,\" \"unlock potential,\" \"seamless collaboration,\" and \"imaginative spark.\" They drain your writing of authenticity.",
    "If your post sounds like it was written by a well-trained corporate bot, it *was* (or might as well have been). Strip out the soulless enterprise speak.",
    "Your opening line should make someone stop scrolling, not politely nod and keep going.",
    "Avoid corporate buzzword bingo. \"Operational efficiency,\" \"genuine ROI,\" \"strategic innovation\" are dead phrases. Tell me what actually happens, not what sounds good in a board meeting.",
    "Never use passive or gentle language like \"becoming outdated\" when describing a significant shift. Demand attention; don't nudge politely.",
    "Avoid overly descriptive yet bland adjectives. If an adjective doesn't add punch, clarity, or unique insight, cut it.",
    "Stop asking generic \"engagement questions\" at the end of a post. If your content doesn't spark discussion naturally, a forced question won't fix it.",
    "Cut weak, mixed, or extended analogies. Get straight to the point or use a single, strong, and consistent metaphor.",
    "Eliminate corporate buzzwords like \"resilient systems\" unless you follow immediately with a concrete, measurable explanation of what that means in *your* context.",
    "Never use \"foundational shift\" or \"new reality\" unless you want to sound like every other generic \"thought leader\" post generated by a bot. It screams \"I read this in a McKinsey report once.\"",
    "Never open with \"The ugly truth?\" – it's a cliché shortcut to gravitas and signals \"AI trying to sound smart.\" Stop it.",
    "Never start a post by stating an obvious, foundational truth about business as if it's a profound insight.",
    "Avoid rhetorical questions that merely repeat the premise of the post.",
    "Stop using generic, diluted adjectives like 'true' to describe innovation. Innovation either is, or it isn't.",
    "Never use \"This isn't theory\" or \"Ignore the hype.\" These are crutches for posts that lack actual substance.",
    "Avoid opening with \"isn't *what* but *how*.\" It's a cliché that signals generic content.",
    "Stop using \"double-digit gains\" unless you follow it immediately with specific, verifiable data. Otherwise, it's just fluff.",
    "Your call to action questions are as generic as the rest of the post. Ask something *specific* or don't ask at all.",
    "Stop using tired corporate buzzwords and phrases like \"operational ROI,\" \"revenue-driving projects,\" or \"measurable impact.\" If it sounds like it came from a marketing brochure you deleted five years ago, don't use it. Speak like a human, not a malfunctioning thesaurus.",
    "Never use the phrase \"The ugly truth.\" It's as original as a stock photo of diverse people laughing at a laptop.",
    "Never use phrases like \"direct hit to your budget and market position\" or \"frees high-value engineers for innovation, not firefighting.\" They are generic, uninspired, and signal that you've outsourced your thinking to an algorithm. Find a human way to say it.",
    "Repetitive use of corporate buzzwords like \"measurable ROI\" or \"data-backed view\" kills any impact. Vary your language or, better yet, imply the benefit with a concrete example instead of just stating the buzzword.",
    "Avoid templated objection-handling like \"X is a valid concern. Yet, data shows clear returns.\" It's condescending and predictable. Address concerns with specific, compelling evidence or a more nuanced perspective, not a canned response.",
    "Avoid corporate buzzword bingo and generic 'thought leader' phrasing that could come from a template. Your post is riddled with phrases like \"real pivot,\" \"doesn't just respond; it performs,\" \"strategic leaders measure value, not just spend,\" \"shifts resources,\" \"high-value work,\" and \"bottleneck to accelerator.\" These are hollow, unoriginal, and instantly mark your content as uninspired.",
    "Don't rely on dramatic, unsubstantiated future predictions like \"By 2026, traditional chatbots will deliver near-zero ROI\" to create artificial urgency. It screams desperation and lack of genuine insight.",
    "Avoid using generic rhetorical questions as hooks or closers; they rarely engage genuinely and often signal a lack of concrete insight.",
    "Eliminate all \"AI-speak\" buzzwords and phrases like \"human bandwidth,\" \"agentic intelligence\" (unless you immediately define it with *specific, tangible examples*), \"operating system for human ingenuity,\" \"liberates focus for strategic thought,\" and \"human-centric future.\" These are empty calories for the brain. If your grandmother can't understand the core concept without a dictionary, simplify it.",
    "Do not use vague, feel-good adjectives (e.g., \"boldest,\" \"amplified,\" \"strategic,\" \"innovative\") without attaching them to something concrete and demonstrable. Show, don't tell, especially when \"telling\" means using more buzzwords.",
    "Eradicate generic business jargon like \"low-value, repetitive tasks\" or \"higher-impact strategic work.\" Show, don't tell, with specific, impactful scenarios.",
    "Your opening must shock, challenge, or provoke. A dry statistic followed by corporate buzzwords is the fast track to being scrolled past.",
    "Stop asking generic engagement questions at the end. Make a definitive statement, issue a challenge, or offer a unique insight. Don't beg for comments.",
    "Never use phrases like \"Actionable Takeaway.\" It's the hallmark of generic, AI-assisted content that adds no actual value.",
    "Stop using subheadings like \"The Misconception\" or \"The 3-Step Reality.\" You're writing a LinkedIn post, not a white paper outline from 2005. It's painfully predictable.",
    "Don't end your post with a lazy, generic engagement question like \"What specific challenge are you facing...?\" It's a transparent plea for comments, not a genuine attempt to spark conversation.",
    "Never use phrases like 'calculated inaction penalty' or 'strategic trade-off is clear' if you want to sound like a human with original thoughts, not a corporate marketing bot. These are dead giveaways of automated thought leadership.",
    "If your post could be written by an AI after scanning 10,000 corporate white papers, it needs to be scrapped and rewritten by a human.",
    "Stop using generic corporate buzzwords like \"autonomy,\" \"efficiency,\" \"redeployment of talent,\" and \"productivity engine\" without providing *specific, tangible, non-obvious* examples or data that couldn't be found in a press release from 2018.",
    "Hooks must be provocative, counter-intuitive, or intensely specific to cut through the noise. A rhetorical question about an abstract percentage is none of these.",
    "Your \"call to action\" (\"What's the cost of waiting?\") sounds less like a challenge and more like a sad puppy asking for scraps. Give it teeth or make it actionable.",
    "Never use \"significant\" or \"drastically\" to describe an impact; use numbers or stronger, more specific verbs.",
    "Your core thesis should be clear, but avoid over-indexing on a single academic term that might alienate a broader audience if overused. Sometimes a simpler, equally impactful phrase gets the job done without feeling like you're correcting a philosophy paper.",
    "Never dump a dense paragraph of generic adjectives as your \"visual concept.\" If you can't describe your *own* vision in concise, evocative terms, you have no vision.",
    "Don't just define; disrupt. Your post should spark a thought, not just provide a Wikipedia entry. Give us *your* opinion, *your* unique struggle, or *your* audacious prediction, not just the universally agreed-upon facts.",
    "All statistics and failure rates must be cited or clearly qualified as estimates. Don't throw numbers around like confetti if you can't back them up.",
    "Never introduce unexplained technical acronyms; they sound pretentious, not profound.",
    "Your hook needs to be a punch in the gut, not a polite nod. Make me feel something, not just think \"hmm, a general observation.\"",
    "Stop using corporate buzzwords and aspirational statements (\"shifts creators from mechanics to visionaries,\" \"speeds innovation,\" \"enabling a wider range of minds\") that add zero actual insight or unique perspective. They make your post sound like a press release written by a bot.",
    "If your post reads like it could be about *any* new transformative technology (blockchain, metaverse, quantum computing), it's failing. Get specific, get real.",
    "LinkedIn is not a platform for abstract poetry. If your post doesn't offer a clear insight, a challenge, a solution, or a relatable experience, it's just noise.",
    "Stop treating your LinkedIn post like a movie trailer script. No one cares about your cinematic vision unless you're actually a filmmaker pitching a film.",
    "If you need to describe an image with more than three carefully chosen adjectives, you've probably already lost your audience. AI image prompts are for machines, not for human comprehension.",
    "Never use rhetorical questions as a substitute for actual content or a call to action. They just highlight your lack of a clear point.",
    "Avoid overly dramatic or self-aggrandizing metaphorical framing in the hook. Get straight to the point and trust your reader to understand the stakes without your \"magnifying glass.\"",
    "Do not rely on \"This isn't just X; it's Y\" structures to convey insight. It's a common AI trope to sound profound without actually saying much that's new.",
    "Blend technical jargon sparingly with natural language; do not force academic terms like \"agentic capabilities\" or \"foundational solution\" into dramatic prose if you want to sound like a human.",
    "Break down complex ideas into shorter, more digestible sentences for clarity and impact. Nobody wants to wade through a thesis-length sentence about \"ongoing research to ensure AI agent reliability...\" on LinkedIn.",
    "Avoid templated engagement structures (question-contrarian-rhetorical questions-call to action) that reek of AI-optimized content.",
    "Stop trying to sound like a digital philosopher. If your 'personal insights' are just a string of tech buzzwords and canned productivity phrases, you're not insightful, you're just another bot in human clothing.",
    "Merely avoiding explicit \"AI language\" doesn't absolve you if the *idea itself* is a generic, templated take that could be generated by an LLM summarizing common LinkedIn cynicism. If your \"hot take\" is actually a cold, reheated meme, it's a failure of originality.",
    "Avoid fake questions."
  ],
  "history": [
    {
      "date": "manual",
      "topic": "AI",
      "vibe": "The Pragmatist",
      "urn": "urn:li:share:123",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-10T13:07:49.584113",
      "topic": "AI",
      "vibe": "The Maxer",
      "urn": "urn:li:share:123",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-10T11:20:30.236411",
      "topic": "The future of coding is Agentic",
      "vibe": "The Data Detective",
      "urn": "urn:li:share:7415714146421317632",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-11T09:13:03.531459",
      "topic": "LLMs as Operating Systems",
      "vibe": "The Rebel",
      "urn": "urn:li:share:7416044462352719872",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-11T11:14:42.647305",
      "topic": "LLMs as Operating Systems",
      "vibe": "The Zen Coder",
      "urn": "urn:li:share:7416075076896198656",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-11T17:10:57.420230",
      "topic": "Why Chatbots are dead",
      "vibe": "The Provocateur",
      "urn": "urn:li:share:7416164729024532481",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-12T21:41:12.689996",
      "topic": "AI",
      "vibe": "The Contrarian",
      "urn": "urn:li:share:123",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-13T09:19:22.647350",
      "topic": "Prompt Engineering is replaced by Flow Engineering",
      "vibe": "The Anthropologist",
      "urn": "urn:li:share:7416770828337512448",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-13T10:18:26.626037",
      "topic": "The future of coding is Agentic",
      "vibe": "The Storyteller",
      "urn": "urn:li:share:7416785690467823616",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-13T17:18:50.703842",
      "topic": "The rise of Multi-Agent Systems",
      "vibe": "The Debunker",
      "urn": "urn:li:share:7416891490024644608",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-14T09:57:35.999056",
      "topic": "AI",
      "vibe": "The Analyst",
      "urn": "urn:li:share:123",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-14T13:29:40.961979",
      "topic": "AI",
      "vibe": "The Maxer",
      "urn": "urn:li:share:123",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-14T13:30:06.638193",
      "topic": "AI",
      "vibe": "The Architect",
      "urn": "urn:li:share:123",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-17T17:09:34.593591",
      "topic": "The rise of Multi-Agent Systems",
      "vibe": "The Visionary",
      "urn": "urn:li:share:7418338709764259842",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-17T19:35:57.529024",
      "topic": "Prompt Engineering is replaced by Flow Engineering",
      "vibe": "The Provocateur",
      "urn": "urn:li:share:7418375547912794114",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-17T19:59:29.628875",
      "topic": "LLMs as Operating Systems",
      "vibe": "The Contrarian",
      "urn": "urn:li:share:7418381470500618240",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    },
    {
      "date": "2026-01-18T09:12:38.033852",
      "topic": "Why Chatbots are dead",
      "vibe": "The Oracle",
      "urn": "urn:li:share:7418581070599774208",
      "stats": {
        "likes": 0,
        "comments": 0
      }
    }
  ],
  "latest_comment_pack": "### 🤝 Comment Pack for The Demise of Chatbots in 2026\n**1. Value Add:** I agree that basic chatbots are on their way out. We're already seeing companies like [mention a specific company using advanced conversational AI in your industry] achieving significantly higher customer satisfaction scores using LLM-powered assistants compared to their previous chatbot implementations. It's all about delivering real value and understanding context now.\n\n**2. Contrarian:** While the trend is definitely towards more sophisticated AI, I think reports of the complete demise of simpler chatbots are premature. For very specific, frequently asked questions, a basic chatbot can still provide a fast and cost-effective solution. It really depends on the use case and the target audience. Not everyone needs (or wants) a fully personalized AI experience for every interaction.\n\n**3. Question:** If traditional chatbots are truly becoming obsolete, how do we ensure a smooth transition for businesses that have already invested heavily in these systems? What strategies can companies use to migrate to more advanced conversational AI without disrupting their current operations and customer service workflows, especially when dealing with legacy data and processes?",
  "last_updated": "21109281966"
}